app/Models/Data_diklat_model.php

SELECT SUM(total) as total
FROM `vw_pelamar_gabungan_summary`
---
            }elseif ($type=='summary') {
                $db=$this->db->table('vw_pelamar_gabungan_summary')->select('*');
            }elseif ($type=='detail') {
                return array(
                    'query'         => $this->db->table('vw_pelamar_gabungan')->select('"",nama,email,gender,wilayah,prop_inst,nama_inst,pnddkn,jurusan,penempatan,tahun'),
                    'column_order'  => array('','nama', 'gender', 'wilayah','nama_inst', 'pnddkn', 'jurusan', 'penempatan', 'tahun'),
                    'order'         => array('tahun' => 'asc'),
                    'column_search' => array('nama', 'gender', 'wilayah','nama_inst', 'pnddkn', 'jurusan', 'penempatan','email','prop_inst')
                    );